


&НаКлиенте
Процедура СуммаПоДокументуПриИзменении(Элемент)
	
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсEURПриИзменении(Элемент)
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КурсUSDПриИзменении(Элемент)
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
КонецПроцедуры
