
&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекущиеДанныеТаблицы = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекущиеДанныеТаблицы.Сумма = ТекущиеДанныеТаблицы.Цена;
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
КонецПроцедуры




&НаСервере
Процедура СписокНоменклатурыСуммаПриИзмененииНаСервере()
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	СписокНоменклатурыСуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КурсEURПриИзменении(Элемент)
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КурсUSDПриИзменении(Элемент)
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
КонецПроцедуры

