Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ЕСТЬNULL(ВзаиморасчетыОстатки.Соглашение, 0) КАК Соглашение,
	|	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВзаиморасчетыОстатки.СуммаUSDОстаток КАК СуммаUSDОстаток,
	|	ВзаиморасчетыОстатки.СуммаEURОстаток КАК СуммаEURОстаток,
	|	ЕСТЬNULL(Соглашения.ДатаОплаты, 0) КАК ДатаОплаты
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Соглашения КАК Соглашения
	|		ПО ВзаиморасчетыОстатки.Соглашение = Соглашения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Поставщик);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Соглашение = Соглашение;
		Движение.Контрагент = Поставщик;
		Движение.Сумма = СуммаПоДокументу;
		Движение.СуммаUSD = СуммаUSD;
		Движение.СуммаEUR = СуммаEUR;
		Возврат;
	КонецЕсли;
	СуммыКЗаписи = Новый Структура;
	СуммыКЗаписи.Вставить("Руб", СуммаПоДокументу);
	СуммыКЗаписи.Вставить("Дол", СуммаUSD);
	СуммыКЗаписи.Вставить("Евр", СуммаEUR);	
	Выборка = Результат.Выбрать();
	СуммыКЗаписи = ПроверкаАванса(Выборка, СуммыКЗаписи);
	Если СуммыКЗаписи.Руб > 0 Тогда
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Поставщик;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Если ЗначениеЗаполнено(Соглашение) = Истина Тогда
			Движение.Соглашение = Соглашение;
			Движение.Сумма = СуммыКЗаписи.Руб;
			Движение.СуммаUSD = СуммыКЗаписи.Дол;
			Движение.СуммаEUR = СуммыКЗаписи.Евр;
		Иначе
			Движение.Сумма = СуммыКЗаписи.Руб;
			Движение.СуммаUSD = СуммыКЗаписи.Дол;
			Движение.СуммаEUR = СуммыКЗаписи.Евр;
		КонецЕсли;
	КонецЕсли

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Функция ПроверкаАванса(Выборка, СуммыКЗаписи)
	Пока Выборка.Следующий() И НЕ ЗначениеЗаполнено(Выборка.Соглашение) И СуммыКЗаписи.Руб > 0 Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Поставщик;
		Если СуммыКЗаписи.Руб < Выборка.СуммаОстаток Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = СуммыКЗаписи.Руб;
			Движение.СуммаUSD = СуммыКЗаписи.Дол;
			Движение.СуммаEUR = СуммыКЗаписи.Евр;
			СуммыКЗаписи.Руб = 0;
			СуммыКЗаписи.Дол = 0;
			СуммыКЗаписи.Евр = 0;
		ИначеЕсли СуммыКЗаписи.Руб = Выборка.СуммаОстаток Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = Выборка.СуммаОстаток;
			Движение.СуммаUSD = Выборка.СуммаUSDОстаток;
			Движение.СуммаEUR = Выборка.СуммаEURОстаток;
			СуммыКЗаписи.Руб = 0;
			СуммыКЗаписи.Дол = 0;
			СуммыКЗаписи.Евр = 0;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			СуммыКЗаписи.Руб = СуммыКЗаписи.Руб - Выборка.СуммаОстаток;
			СуммыКЗаписи.Дол = СуммыКЗаписи.Дол - Выборка.СуммаUSDОстаток;
			СуммыКЗаписи.Евр = СуммыКЗаписи.Евр - Выборка.СуммаEURОстаток;
			Движение.Сумма = Выборка.СуммаОстаток;
			Движение.СуммаUSD = Выборка.СуммаUSDОстаток;
			Движение.СуммаEUR = Выборка.СуммаEURОстаток;
						
		КонецЕсли;
	КонецЦикла;
	Возврат СуммыКЗаписи;
КонецФункции