Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ЕСТЬNULL(ВзаиморасчетыОстатки.Соглашение, 0) КАК Соглашение,
	|	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВзаиморасчетыОстатки.СуммаUSDОстаток КАК СуммаUSDОстаток,
	|	ВзаиморасчетыОстатки.СуммаEURОстаток КАК СуммаEURОстаток,
	|	Соглашения.ДатаОплаты КАК ДатаОплаты
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Соглашения КАК Соглашения
	|		ПО ВзаиморасчетыОстатки.Соглашение = Соглашения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Поставщик);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//		Движение.Соглашение = Соглашение;
		Движение.Контрагент = Поставщик;
		Движение.Сумма = СуммаПоДокументу;
		Движение.СуммаUSD = СуммаUSD;
		Движение.СуммаEUR = СуммаEUR;
		Возврат;
	КонецЕсли;
	
	СуммаКЗаписи = СуммаПоДокументу;
	СуммаКЗаписиUSD = СуммаUSD;
	СуммаКЗаписиEUR = СуммаEUR;
	Выборка = Результат.Выбрать();
	
	Если ЗначениеЗаполнено(Соглашение) Тогда
		Пока Выборка.Следующий() Цикл
			
			Если СуммаКЗаписи > Выборка.СуммаОстаток Тогда
				СуммаКЗаписи = СуммаКЗаписи - Выборка.СуммаОстаток;
				СуммаКЗаписиUSD = СуммаКЗаписиUSD - Выборка.СуммаUSDОстаток;
				СуммаКЗаписиEUR = СуммаКЗаписиEUR - Выборка.СуммаEURОстаток;
				
			ИначеЕсли СуммаКЗаписи = Выборка.СуммаОстаток Тогда
				 СуммаКЗаписи = Выборка.СуммаОстаток;
				 СуммаКЗаписиUSD = Выборка.СуммаUSDОстаток;
				 СуммаКЗаписиEUR = Выборка.СуммаEURОстаток;
			Иначе
				СуммаКЗаписи = Выборка.СуммаОстаток - СуммаКЗаписи;
				СуммаКЗаписиUSD = Выборка.СуммаUSDОстаток - СуммаКЗаписиUSD;
				СуммаКЗаписиEUR = Выборка.СуммаEURОстаток - СуммаКЗаписиEUR;
			КонецЕсли;
			
			Движение = Движения.Взаиморасчеты.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//			Движение.Соглашение = Соглашение;
			Движение.Контрагент = Поставщик;
			Движение.Сумма = СуммаПоДокументу;
			Движение.СуммаUSD = СуммаUSD;
			Движение.СуммаEUR = СуммаEUR;
			
	
	
		
		
	
	

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры