Процедура ОбработкаПроведения(Отказ,Режим)
	
	//	 регистр Взаиморасчеты
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Соглашение = Соглашение;
	Движение.Контрагент = Поставщик;
	Движение.Сумма = СуммаПоДокументу;
	Движение.СуммаUSD = СуммаUSD;
	Движение.СуммаEUR = СуммаEUR;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры